[
  {
    "path": "posts/Stat454capstone/",
    "title": "Bayesian Statistics Capstone Project",
    "description": "Bayesian Finance: Modeling Earnings for S&P 500 Companies",
    "author": [],
    "date": "2021-12-15",
    "categories": [],
    "contents": "\n\n\n\nAbstract\nFinancial information, like stock market prices, are known to be notoriously hard to predict. We wanted to take a Bayesian approach to try and tackle a similar situation: predicting the future earnings of S&P 500 companies. In this project we seek to model future earnings using other financial information about a company, like previous earnings and sales. We explore a few Bayesian hierarchical models, as well as a bayesforcast model to try and identify one that can provide insight and better predictions for future company’s earnings.\nOur project report can be found at: https://nolan-meyer.github.io/bayesian-finance/\n\n\n\n",
    "preview": "posts/Stat454capstone/website_report_screenshot.png",
    "last_modified": "2021-12-13T10:43:20-06:00",
    "input_file": {}
  },
  {
    "path": "posts/Stat112Final/",
    "title": "Intro Data Science Final Project",
    "description": "Building a Soccer Database & Shiny App",
    "author": [],
    "date": "2021-03-11",
    "categories": [],
    "contents": "\n\n\n\nIntroduction\nIntroduction to topic/data\nAll the members in our group play soccer, with three of us on Macalester’s varsity team. Thus we were incredibly interested in incorporating some sort of soccer aspect into our project. We also wanted it to be somewhat specific to our time here at Macalester. Finally, we wanted to challenge ourselves to build our own dataset, and so we did just that. We decided to track Macalester’s men’s soccer team and player statistics for the last few years using a shiny app. After deciding on this, we diverted our attention to finding the necessary data. All the data was available online, we just had to compile data from all seasons dating back to 2012.\nResearch Questions\nOur first research question was: -How can we best compare Macalester men’s soccer team statistics across different seasons? -This would include such statistics as goals scored, goals allowed, assists, shots, etc. -We could also track team performance in general by tracking wins, losses, and draws\nWe also wanted to add on an individual component as well: -What is the best way to compare different player’s individual statistics across different seasons? -Such statistics would include goals, assists, minutes logged, yellow/red cards, etc. -Can we compare players that played on the same team? -Can we compare players that never played on the same team? -Can we track players’ progression through their 4 year career?\nWe also wanted to make it aesthetically pleasing: -What is the most effective way to display this information? -Would it make sense to aggregate certain aspects of the project? Would it aid in delivering the information? -What is the best way to organize the information?\nData Collection\nData Sources\nThe data was pulled from the Macalester Athletics website, specifically the Men’s Soccer page. Within the page there is a tab for statistics, which displays team, individual, game-by-game, and miscellaneous data from 2012-2019. There is also data going back to 2001, but it is limited to game scores.\nCollection process\nTo collect the data, we created a shared google sheet where we copied the data from table format on the web page and pasted it onto our sheet. Some of the individual statistics were broken down into 2 separate variables to better account our ability to display numerical values. The team statistics required a pivot function which we did manually. There were also 4 variables that we calculated, which we thought provided useful additional insight; goals per 90 minutes, assists per 90 minutes, points per 90 minutes, and yellow cards per 90 minutes.\nOnce all the data cleaning was complete, we downloaded the files as .csv, and uploaded them to R. We had a separate file for individual and team statistics.\nManual\nShiny App Link\nGitHub Repo Link\nWelcome to the Macalester Men’s Soccer Database\nWhen you first open the shiny app, it will automatically open to the Player Data screen. At the top of the app, you will see 5 different tabs. Click on one to explore. The section below goes into depth on how to navigate each tab.\nPlayer Data\nThis page displays the raw data for each player.\nOn the top left corner there is a tab “Show 8 entries”. If you click on the number 8, you will see a drop down menu. From there you will be able to change the amount of players displayed on the screen at a time.\nOn the top right corner there is a search bar where you can search for specific players by typing in their name.\nAt the bottom right of the screen, you will see the amount of pages. Use the buttons to navigate in between pages.\nTaking a look at the table, you can see all the raw data for each player. To organize by an individual statistic, click on the variable on the top. The first click will show from lowest to highest, and another click will show from highest to lowest. Once you click on another variable, the previous organization is undone.\nAt the bottom right of the screen, you will see the amount of pages. Use the buttons to navigate in between pages.\nTeam Data\nThis page displays the raw data for each season’s team.\nOn the top left corner there is a tab “Show 8 entries”. If you click on the number 8, you will see a drop down menu. From there you will be able to change the amount of teams displayed on the screen at a time. Note: there is only data for 8 teams.\nOn the top right corner there is a search bar where you can search for specific teams by typing in their season’s year.\nAt the bottom right of the screen, you will see the amount of pages. Use the buttons to navigate in between pages.\nTaking a look at the table, you can see all the raw data for each team. To organize by an individual statistic, click on the variable on the top. The first click will show from lowest to highest, and another click will show from highest to lowest. Once you click on another variable, the previous organization is undone.\nAt the bottom right of the screen, you will see the amount of pages. Use the buttons to navigate in between pages.\nPlayer Time Series\nOn the left side of the screen there are dropdowns and a slider which are the inputs for the graph you wish to display. The first dropdown is to select the statistic that you want to look at, which includes all of the variables listed on the Player Data table. The following 3 dropdowns are to select the individual players you wish to compare. The slider filters the data to the seasons you wish to look at.\nOnce finished, click create plot and your plot will be displayed on the right side of the screen.\nThe plot, located on the right side of the screen, is interactive. Hover over the points to get more data about the data point. Additionally, you can click and drag on the plot to create a box over a specific section of the screen, this will zoom you into that section.\nAt the top right side of the plot are several buttons with more functions you can perform. Hovering over them will allow you to understand what they do, such as zooming in and out, as well as downloading the plot as a png.\nTeam Time Series\nOn the left side of the screen there are dropdowns and a slider which are the inputs for the graph you wish to display. The 3 dropdowns are to select the statistics that you want to look at, which includes all of the variables listed on the Team Data table. The slider filters the data to the seasons you wish to look at.\nOnce finished, click create plot and your plot will be displayed on the right side of the screen.\nThe plot, located on the right side of the screen, is interactive. Hover over the points to get more data about the data point. Additionally, you can click and drag on the plot to create a box over a specific section of the screen, this will zoom you into that section.\nAt the top right side of the plot are several buttons with more functions you can perform. Hovering over them will allow you to understand what they do, such as zooming in and out, as well as downloading the plot as a png.\nPlayer Scatter Plot\nOn the left side of the screen there are dropdowns and a slider which are the inputs for the graph you wish to display. The first 2 dropdowns are to select the statistics that you want to look at, which includes all of the variables listed on the Player Data table. The sliders filter the data to the seasons, minutes, and games played that you wish to look at\nOnce finished, click create plot and your plot will be displayed on the right side of the screen.\nThe plot, located on the right side of the screen, is interactive. Hover over the points to get more data about the data point. Additionally, you can click and drag on the plot to create a box over a specific section of the screen, this will zoom you into that section.\nAt the top right side of the plot are several buttons with more functions you can perform. Hovering over them will allow you to understand what they do, such as zooming in and out, as well as downloading the plot as a png.\n\n\n\n",
    "preview": "posts/Stat112Final/shinyappscreenshot.png",
    "last_modified": "2021-12-01T11:43:50-06:00",
    "input_file": {}
  }
]
